grevaillot/svd_tools/headers/STM32F7x5/rcc.h
#pragma once 

/* --- RCC: Reset and clock control --------------------------------- */

/** @defgroup rcc_registers Reset and clock control Register
@{*/

/** RCC_CR clock control register **/
#define RCC_CR			MMIO32(RCC_BASE + 0x00)
/** RCC_PLLCFGR PLL configuration register **/
#define RCC_PLLCFGR			MMIO32(RCC_BASE + 0x04)
/** RCC_CFGR clock configuration register **/
#define RCC_CFGR			MMIO32(RCC_BASE + 0x08)
/** RCC_CIR clock interrupt register **/
#define RCC_CIR			MMIO32(RCC_BASE + 0x0c)
/** RCC_AHB1RSTR AHB1 peripheral reset register **/
#define RCC_AHB1RSTR			MMIO32(RCC_BASE + 0x10)
/** RCC_AHB2RSTR AHB2 peripheral reset register **/
#define RCC_AHB2RSTR			MMIO32(RCC_BASE + 0x14)
/** RCC_AHB3RSTR AHB3 peripheral reset register **/
#define RCC_AHB3RSTR			MMIO32(RCC_BASE + 0x18)
/** RCC_APB1RSTR APB1 peripheral reset register **/
#define RCC_APB1RSTR			MMIO32(RCC_BASE + 0x20)
/** RCC_APB2RSTR APB2 peripheral reset register **/
#define RCC_APB2RSTR			MMIO32(RCC_BASE + 0x24)
/** RCC_AHB1ENR AHB1 peripheral clock register **/
#define RCC_AHB1ENR			MMIO32(RCC_BASE + 0x30)
/** RCC_AHB2ENR AHB2 peripheral clock enable register **/
#define RCC_AHB2ENR			MMIO32(RCC_BASE + 0x34)
/** RCC_AHB3ENR AHB3 peripheral clock enable register **/
#define RCC_AHB3ENR			MMIO32(RCC_BASE + 0x38)
/** RCC_APB1ENR APB1 peripheral clock enable register **/
#define RCC_APB1ENR			MMIO32(RCC_BASE + 0x40)
/** RCC_APB2ENR APB2 peripheral clock enable register **/
#define RCC_APB2ENR			MMIO32(RCC_BASE + 0x44)
/** RCC_AHB1LPENR AHB1 peripheral clock enable in low power mode register **/
#define RCC_AHB1LPENR			MMIO32(RCC_BASE + 0x50)
/** RCC_AHB2LPENR AHB2 peripheral clock enable in low power mode register **/
#define RCC_AHB2LPENR			MMIO32(RCC_BASE + 0x54)
/** RCC_AHB3LPENR AHB3 peripheral clock enable in low power mode register **/
#define RCC_AHB3LPENR			MMIO32(RCC_BASE + 0x58)
/** RCC_APB1LPENR APB1 peripheral clock enable in low power mode register **/
#define RCC_APB1LPENR			MMIO32(RCC_BASE + 0x60)
/** RCC_APB2LPENR APB2 peripheral clock enabled in low power mode register **/
#define RCC_APB2LPENR			MMIO32(RCC_BASE + 0x64)
/** RCC_BDCR Backup domain control register **/
#define RCC_BDCR			MMIO32(RCC_BASE + 0x70)
/** RCC_CSR clock control & status register **/
#define RCC_CSR			MMIO32(RCC_BASE + 0x74)
/** RCC_SSCGR spread spectrum clock generation register **/
#define RCC_SSCGR			MMIO32(RCC_BASE + 0x80)
/** RCC_PLLI2SCFGR PLLI2S configuration register **/
#define RCC_PLLI2SCFGR			MMIO32(RCC_BASE + 0x84)
/** RCC_PLLSAICFGR PLL configuration register **/
#define RCC_PLLSAICFGR			MMIO32(RCC_BASE + 0x88)
/** RCC_DKCFGR1 dedicated clocks configuration register **/
#define RCC_DKCFGR1			MMIO32(RCC_BASE + 0x8c)
/** RCC_DKCFGR2 dedicated clocks configuration register **/
#define RCC_DKCFGR2			MMIO32(RCC_BASE + 0x90)

/**@}*/


/** @defgroup rcc_cr CR clock control register
@{*/

/** RCC_CR_PLLI2SRDY PLLI2S clock ready flag **/
#define RCC_CR_PLLI2SRDY		(1 << 27)
/** RCC_CR_PLLI2SON PLLI2S enable **/
#define RCC_CR_PLLI2SON		(1 << 26)
/** RCC_CR_PLLRDY Main PLL (PLL) clock ready flag **/
#define RCC_CR_PLLRDY		(1 << 25)
/** RCC_CR_PLLON Main PLL (PLL) enable **/
#define RCC_CR_PLLON		(1 << 24)
/** RCC_CR_CSSON Clock security system enable **/
#define RCC_CR_CSSON		(1 << 19)
/** RCC_CR_HSEBYP HSE clock bypass **/
#define RCC_CR_HSEBYP		(1 << 18)
/** RCC_CR_HSERDY HSE clock ready flag **/
#define RCC_CR_HSERDY		(1 << 17)
/** RCC_CR_HSEON HSE clock enable **/
#define RCC_CR_HSEON		(1 << 16)

#define RCC_CR_HSICAL_SHIFT		8
#define RCC_CR_HSICAL_MASK		0xff
/** @defgroup rcc_cr_hsical HSICAL Internal high-speed clock calibration
@{*/
/**@}*/


#define RCC_CR_HSITRIM_SHIFT		3
#define RCC_CR_HSITRIM_MASK		0x1f
/** @defgroup rcc_cr_hsitrim HSITRIM Internal high-speed clock trimming
@{*/
/**@}*/

/** RCC_CR_HSIRDY Internal high-speed clock ready flag **/
#define RCC_CR_HSIRDY		(1 << 1)
/** RCC_CR_HSION Internal high-speed clock enable **/
#define RCC_CR_HSION		(1 << 0)

/**@}*/

/** @defgroup rcc_pllcfgr PLLCFGR PLL configuration register
@{*/

/** RCC_PLLCFGR_PLLQ3 Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks **/
#define RCC_PLLCFGR_PLLQ3		(1 << 27)
/** RCC_PLLCFGR_PLLQ2 Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks **/
#define RCC_PLLCFGR_PLLQ2		(1 << 26)
/** RCC_PLLCFGR_PLLQ1 Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks **/
#define RCC_PLLCFGR_PLLQ1		(1 << 25)
/** RCC_PLLCFGR_PLLQ0 Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks **/
#define RCC_PLLCFGR_PLLQ0		(1 << 24)
/** RCC_PLLCFGR_PLLSRC Main PLL(PLL) and audio PLL (PLLI2S) entry clock source **/
#define RCC_PLLCFGR_PLLSRC		(1 << 22)
/** RCC_PLLCFGR_PLLP1 Main PLL (PLL) division factor for main system clock **/
#define RCC_PLLCFGR_PLLP1		(1 << 17)
/** RCC_PLLCFGR_PLLP0 Main PLL (PLL) division factor for main system clock **/
#define RCC_PLLCFGR_PLLP0		(1 << 16)
/** RCC_PLLCFGR_PLLN8 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN8		(1 << 14)
/** RCC_PLLCFGR_PLLN7 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN7		(1 << 13)
/** RCC_PLLCFGR_PLLN6 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN6		(1 << 12)
/** RCC_PLLCFGR_PLLN5 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN5		(1 << 11)
/** RCC_PLLCFGR_PLLN4 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN4		(1 << 10)
/** RCC_PLLCFGR_PLLN3 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN3		(1 << 9)
/** RCC_PLLCFGR_PLLN2 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN2		(1 << 8)
/** RCC_PLLCFGR_PLLN1 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN1		(1 << 7)
/** RCC_PLLCFGR_PLLN0 Main PLL (PLL) multiplication factor for VCO **/
#define RCC_PLLCFGR_PLLN0		(1 << 6)
/** RCC_PLLCFGR_PLLM5 Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock **/
#define RCC_PLLCFGR_PLLM5		(1 << 5)
/** RCC_PLLCFGR_PLLM4 Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock **/
#define RCC_PLLCFGR_PLLM4		(1 << 4)
/** RCC_PLLCFGR_PLLM3 Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock **/
#define RCC_PLLCFGR_PLLM3		(1 << 3)
/** RCC_PLLCFGR_PLLM2 Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock **/
#define RCC_PLLCFGR_PLLM2		(1 << 2)
/** RCC_PLLCFGR_PLLM1 Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock **/
#define RCC_PLLCFGR_PLLM1		(1 << 1)
/** RCC_PLLCFGR_PLLM0 Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock **/
#define RCC_PLLCFGR_PLLM0		(1 << 0)

/**@}*/

/** @defgroup rcc_cfgr CFGR clock configuration register
@{*/


