grevaillot/svd_tools/headers/STM32F7x5/rcc.h
/** @defgroup rcc_apb1rstr APB1RSTR APB1 peripheral reset register
@{*/

/** RCC_APB1RSTR_UART8RST UART8 reset **/
#define RCC_APB1RSTR_UART8RST		(1 << 31)
/** RCC_APB1RSTR_UART7RST UART7 reset **/
#define RCC_APB1RSTR_UART7RST		(1 << 30)
/** RCC_APB1RSTR_DACRST DAC reset **/
#define RCC_APB1RSTR_DACRST		(1 << 29)
/** RCC_APB1RSTR_PWRRST Power interface reset **/
#define RCC_APB1RSTR_PWRRST		(1 << 28)
/** RCC_APB1RSTR_CECRST HDMI-CEC reset **/
#define RCC_APB1RSTR_CECRST		(1 << 27)
/** RCC_APB1RSTR_CAN2RST CAN2 reset **/
#define RCC_APB1RSTR_CAN2RST		(1 << 26)
/** RCC_APB1RSTR_CAN1RST CAN1 reset **/
#define RCC_APB1RSTR_CAN1RST		(1 << 25)
/** RCC_APB1RSTR_I2C4RST I2C 4 reset **/
#define RCC_APB1RSTR_I2C4RST		(1 << 24)
/** RCC_APB1RSTR_I2C3RST I2C3 reset **/
#define RCC_APB1RSTR_I2C3RST		(1 << 23)
/** RCC_APB1RSTR_I2C2RST I2C 2 reset **/
#define RCC_APB1RSTR_I2C2RST		(1 << 22)
/** RCC_APB1RSTR_I2C1RST I2C 1 reset **/
#define RCC_APB1RSTR_I2C1RST		(1 << 21)
/** RCC_APB1RSTR_UART5RST USART 5 reset **/
#define RCC_APB1RSTR_UART5RST		(1 << 20)
/** RCC_APB1RSTR_UART4RST USART 4 reset **/
#define RCC_APB1RSTR_UART4RST		(1 << 19)
/** RCC_APB1RSTR_UART3RST USART 3 reset **/
#define RCC_APB1RSTR_UART3RST		(1 << 18)
/** RCC_APB1RSTR_UART2RST USART 2 reset **/
#define RCC_APB1RSTR_UART2RST		(1 << 17)
/** RCC_APB1RSTR_SPDIFRXRST SPDIF-RX reset **/
#define RCC_APB1RSTR_SPDIFRXRST		(1 << 16)
/** RCC_APB1RSTR_SPI3RST SPI 3 reset **/
#define RCC_APB1RSTR_SPI3RST		(1 << 15)
/** RCC_APB1RSTR_SPI2RST SPI 2 reset **/
#define RCC_APB1RSTR_SPI2RST		(1 << 14)
/** RCC_APB1RSTR_WWDGRST Window watchdog reset **/
#define RCC_APB1RSTR_WWDGRST		(1 << 11)
/** RCC_APB1RSTR_LPTIM1RST Low power timer 1 reset **/
#define RCC_APB1RSTR_LPTIM1RST		(1 << 9)
/** RCC_APB1RSTR_TIM14RST TIM14 reset **/
#define RCC_APB1RSTR_TIM14RST		(1 << 8)
/** RCC_APB1RSTR_TIM13RST TIM13 reset **/
#define RCC_APB1RSTR_TIM13RST		(1 << 7)
/** RCC_APB1RSTR_TIM12RST TIM12 reset **/
#define RCC_APB1RSTR_TIM12RST		(1 << 6)
/** RCC_APB1RSTR_TIM7RST TIM7 reset **/
#define RCC_APB1RSTR_TIM7RST		(1 << 5)
/** RCC_APB1RSTR_TIM6RST TIM6 reset **/
#define RCC_APB1RSTR_TIM6RST		(1 << 4)
/** RCC_APB1RSTR_TIM5RST TIM5 reset **/
#define RCC_APB1RSTR_TIM5RST		(1 << 3)
/** RCC_APB1RSTR_TIM4RST TIM4 reset **/
#define RCC_APB1RSTR_TIM4RST		(1 << 2)
/** RCC_APB1RSTR_TIM3RST TIM3 reset **/
#define RCC_APB1RSTR_TIM3RST		(1 << 1)
/** RCC_APB1RSTR_TIM2RST TIM2 reset **/
#define RCC_APB1RSTR_TIM2RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2rstr APB2RSTR APB2 peripheral reset register
@{*/

/** RCC_APB2RSTR_LTDCRST LTDC reset **/
#define RCC_APB2RSTR_LTDCRST		(1 << 26)
/** RCC_APB2RSTR_SAI2RST SAI2 reset **/
#define RCC_APB2RSTR_SAI2RST		(1 << 23)
/** RCC_APB2RSTR_SAI1RST SAI1 reset **/
#define RCC_APB2RSTR_SAI1RST		(1 << 22)
/** RCC_APB2RSTR_SPI6RST SPI6 reset **/
#define RCC_APB2RSTR_SPI6RST		(1 << 21)
/** RCC_APB2RSTR_SPI5RST SPI5 reset **/
#define RCC_APB2RSTR_SPI5RST		(1 << 20)
/** RCC_APB2RSTR_TIM11RST TIM11 reset **/
#define RCC_APB2RSTR_TIM11RST		(1 << 18)
/** RCC_APB2RSTR_TIM10RST TIM10 reset **/
#define RCC_APB2RSTR_TIM10RST		(1 << 17)
/** RCC_APB2RSTR_TIM9RST TIM9 reset **/
#define RCC_APB2RSTR_TIM9RST		(1 << 16)
/** RCC_APB2RSTR_SYSCFGRST System configuration controller reset **/
#define RCC_APB2RSTR_SYSCFGRST		(1 << 14)
/** RCC_APB2RSTR_SPI4RST SPI4 reset **/
#define RCC_APB2RSTR_SPI4RST		(1 << 13)
/** RCC_APB2RSTR_SPI1RST SPI 1 reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_SDMMC1RST SDMMC1 reset **/
#define RCC_APB2RSTR_SDMMC1RST		(1 << 11)
/** RCC_APB2RSTR_ADCRST ADC interface reset (common to all ADCs) **/
#define RCC_APB2RSTR_ADCRST		(1 << 8)
/** RCC_APB2RSTR_USART6RST USART6 reset **/
#define RCC_APB2RSTR_USART6RST		(1 << 5)
/** RCC_APB2RSTR_USART1RST USART1 reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 4)
/** RCC_APB2RSTR_TIM8RST TIM8 reset **/
#define RCC_APB2RSTR_TIM8RST		(1 << 1)
/** RCC_APB2RSTR_TIM1RST TIM1 reset **/
#define RCC_APB2RSTR_TIM1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1enr AHB1ENR AHB1 peripheral clock register
@{*/

/** RCC_AHB1ENR_OTGHSULPIEN USB OTG HSULPI clock enable **/
#define RCC_AHB1ENR_OTGHSULPIEN		(1 << 30)
/** RCC_AHB1ENR_OTGHSEN USB OTG HS clock enable **/
#define RCC_AHB1ENR_OTGHSEN		(1 << 29)
/** RCC_AHB1ENR_ETHMACPTPEN Ethernet PTP clock enable **/
#define RCC_AHB1ENR_ETHMACPTPEN		(1 << 28)
/** RCC_AHB1ENR_ETHMACRXEN Ethernet Reception clock enable **/
#define RCC_AHB1ENR_ETHMACRXEN		(1 << 27)
/** RCC_AHB1ENR_ETHMACTXEN Ethernet Transmission clock enable **/
#define RCC_AHB1ENR_ETHMACTXEN		(1 << 26)
/** RCC_AHB1ENR_ETHMACEN Ethernet MAC clock enable **/
#define RCC_AHB1ENR_ETHMACEN		(1 << 25)
/** RCC_AHB1ENR_DMA2DEN DMA2D clock enable **/
#define RCC_AHB1ENR_DMA2DEN		(1 << 23)
/** RCC_AHB1ENR_DMA2EN DMA2 clock enable **/
#define RCC_AHB1ENR_DMA2EN		(1 << 22)
/** RCC_AHB1ENR_DMA1EN DMA1 clock enable **/
#define RCC_AHB1ENR_DMA1EN		(1 << 21)
/** RCC_AHB1ENR_CCMDATARAMEN CCM data RAM clock enable **/
#define RCC_AHB1ENR_CCMDATARAMEN		(1 << 20)
/** RCC_AHB1ENR_BKPSRAMEN Backup SRAM interface clock enable **/
#define RCC_AHB1ENR_BKPSRAMEN		(1 << 18)
/** RCC_AHB1ENR_CRCEN CRC clock enable **/
#define RCC_AHB1ENR_CRCEN		(1 << 12)
/** RCC_AHB1ENR_GPIOKEN IO port K clock enable **/
#define RCC_AHB1ENR_GPIOKEN		(1 << 10)
/** RCC_AHB1ENR_GPIOJEN IO port J clock enable **/
#define RCC_AHB1ENR_GPIOJEN		(1 << 9)
/** RCC_AHB1ENR_GPIOIEN IO port I clock enable **/
#define RCC_AHB1ENR_GPIOIEN		(1 << 8)
/** RCC_AHB1ENR_GPIOHEN IO port H clock enable **/
#define RCC_AHB1ENR_GPIOHEN		(1 << 7)
/** RCC_AHB1ENR_GPIOGEN IO port G clock enable **/
#define RCC_AHB1ENR_GPIOGEN		(1 << 6)
/** RCC_AHB1ENR_GPIOFEN IO port F clock enable **/
#define RCC_AHB1ENR_GPIOFEN		(1 << 5)
/** RCC_AHB1ENR_GPIOEEN IO port E clock enable **/
#define RCC_AHB1ENR_GPIOEEN		(1 << 4)
/** RCC_AHB1ENR_GPIODEN IO port D clock enable **/
#define RCC_AHB1ENR_GPIODEN		(1 << 3)
/** RCC_AHB1ENR_GPIOCEN IO port C clock enable **/
#define RCC_AHB1ENR_GPIOCEN		(1 << 2)
/** RCC_AHB1ENR_GPIOBEN IO port B clock enable **/
#define RCC_AHB1ENR_GPIOBEN		(1 << 1)
/** RCC_AHB1ENR_GPIOAEN IO port A clock enable **/
#define RCC_AHB1ENR_GPIOAEN		(1 << 0)

/**@}*/

