grevaillot/svd_tools/headers/STM32F7x5/rcc.h
/** @defgroup rcc_ahb2enr AHB2ENR AHB2 peripheral clock enable register
@{*/

/** RCC_AHB2ENR_OTGFSEN USB OTG FS clock enable **/
#define RCC_AHB2ENR_OTGFSEN		(1 << 7)
/** RCC_AHB2ENR_RNGEN Random number generator clock enable **/
#define RCC_AHB2ENR_RNGEN		(1 << 6)
/** RCC_AHB2ENR_HASHEN Hash modules clock enable **/
#define RCC_AHB2ENR_HASHEN		(1 << 5)
/** RCC_AHB2ENR_CRYPEN Cryptographic modules clock enable **/
#define RCC_AHB2ENR_CRYPEN		(1 << 4)
/** RCC_AHB2ENR_DCMIEN Camera interface enable **/
#define RCC_AHB2ENR_DCMIEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3enr AHB3ENR AHB3 peripheral clock enable register
@{*/

/** RCC_AHB3ENR_QSPIEN Quad SPI memory controller clock enable **/
#define RCC_AHB3ENR_QSPIEN		(1 << 1)
/** RCC_AHB3ENR_FMCEN Flexible memory controller module clock enable **/
#define RCC_AHB3ENR_FMCEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr APB1ENR APB1 peripheral clock enable register
@{*/

/** RCC_APB1ENR_UART8ENR UART8 clock enable **/
#define RCC_APB1ENR_UART8ENR		(1 << 31)
/** RCC_APB1ENR_UART7ENR UART7 clock enable **/
#define RCC_APB1ENR_UART7ENR		(1 << 30)
/** RCC_APB1ENR_DACEN DAC interface clock enable **/
#define RCC_APB1ENR_DACEN		(1 << 29)
/** RCC_APB1ENR_PWREN Power interface clock enable **/
#define RCC_APB1ENR_PWREN		(1 << 28)
/** RCC_APB1ENR_CECEN HDMI-CEN clock enable **/
#define RCC_APB1ENR_CECEN		(1 << 27)
/** RCC_APB1ENR_CAN2EN CAN 2 clock enable **/
#define RCC_APB1ENR_CAN2EN		(1 << 26)
/** RCC_APB1ENR_CAN1EN CAN 1 clock enable **/
#define RCC_APB1ENR_CAN1EN		(1 << 25)
/** RCC_APB1ENR_I2C4EN I2C4 clock enable **/
#define RCC_APB1ENR_I2C4EN		(1 << 24)
/** RCC_APB1ENR_I2C3EN I2C3 clock enable **/
#define RCC_APB1ENR_I2C3EN		(1 << 23)
/** RCC_APB1ENR_I2C2EN I2C2 clock enable **/
#define RCC_APB1ENR_I2C2EN		(1 << 22)
/** RCC_APB1ENR_I2C1EN I2C1 clock enable **/
#define RCC_APB1ENR_I2C1EN		(1 << 21)
/** RCC_APB1ENR_UART5EN UART5 clock enable **/
#define RCC_APB1ENR_UART5EN		(1 << 20)
/** RCC_APB1ENR_UART4EN UART4 clock enable **/
#define RCC_APB1ENR_UART4EN		(1 << 19)
/** RCC_APB1ENR_USART3EN USART3 clock enable **/
#define RCC_APB1ENR_USART3EN		(1 << 18)
/** RCC_APB1ENR_USART2EN USART 2 clock enable **/
#define RCC_APB1ENR_USART2EN		(1 << 17)
/** RCC_APB1ENR_SPDIFRXEN SPDIF-RX clock enable **/
#define RCC_APB1ENR_SPDIFRXEN		(1 << 16)
/** RCC_APB1ENR_SPI3EN SPI3 clock enable **/
#define RCC_APB1ENR_SPI3EN		(1 << 15)
/** RCC_APB1ENR_SPI2EN SPI2 clock enable **/
#define RCC_APB1ENR_SPI2EN		(1 << 14)
/** RCC_APB1ENR_WWDGEN Window watchdog clock enable **/
#define RCC_APB1ENR_WWDGEN		(1 << 11)
/** RCC_APB1ENR_LPTMI1EN Low power timer 1 clock enable **/
#define RCC_APB1ENR_LPTMI1EN		(1 << 9)
/** RCC_APB1ENR_TIM14EN TIM14 clock enable **/
#define RCC_APB1ENR_TIM14EN		(1 << 8)
/** RCC_APB1ENR_TIM13EN TIM13 clock enable **/
#define RCC_APB1ENR_TIM13EN		(1 << 7)
/** RCC_APB1ENR_TIM12EN TIM12 clock enable **/
#define RCC_APB1ENR_TIM12EN		(1 << 6)
/** RCC_APB1ENR_TIM7EN TIM7 clock enable **/
#define RCC_APB1ENR_TIM7EN		(1 << 5)
/** RCC_APB1ENR_TIM6EN TIM6 clock enable **/
#define RCC_APB1ENR_TIM6EN		(1 << 4)
/** RCC_APB1ENR_TIM5EN TIM5 clock enable **/
#define RCC_APB1ENR_TIM5EN		(1 << 3)
/** RCC_APB1ENR_TIM4EN TIM4 clock enable **/
#define RCC_APB1ENR_TIM4EN		(1 << 2)
/** RCC_APB1ENR_TIM3EN TIM3 clock enable **/
#define RCC_APB1ENR_TIM3EN		(1 << 1)
/** RCC_APB1ENR_TIM2EN TIM2 clock enable **/
#define RCC_APB1ENR_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR APB2 peripheral clock enable register
@{*/

/** RCC_APB2ENR_LTDCEN LTDC clock enable **/
#define RCC_APB2ENR_LTDCEN		(1 << 26)
/** RCC_APB2ENR_SAI2EN SAI2 clock enable **/
#define RCC_APB2ENR_SAI2EN		(1 << 23)
/** RCC_APB2ENR_SAI1EN SAI1 clock enable **/
#define RCC_APB2ENR_SAI1EN		(1 << 22)
/** RCC_APB2ENR_SPI6ENR SPI6 clock enable **/
#define RCC_APB2ENR_SPI6ENR		(1 << 21)
/** RCC_APB2ENR_SPI5ENR SPI5 clock enable **/
#define RCC_APB2ENR_SPI5ENR		(1 << 20)
/** RCC_APB2ENR_TIM11EN TIM11 clock enable **/
#define RCC_APB2ENR_TIM11EN		(1 << 18)
/** RCC_APB2ENR_TIM10EN TIM10 clock enable **/
#define RCC_APB2ENR_TIM10EN		(1 << 17)
/** RCC_APB2ENR_TIM9EN TIM9 clock enable **/
#define RCC_APB2ENR_TIM9EN		(1 << 16)
/** RCC_APB2ENR_SYSCFGEN System configuration controller clock enable **/
#define RCC_APB2ENR_SYSCFGEN		(1 << 14)
/** RCC_APB2ENR_SPI4ENR SPI4 clock enable **/
#define RCC_APB2ENR_SPI4ENR		(1 << 13)
/** RCC_APB2ENR_SPI1EN SPI1 clock enable **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_SDMMC1EN SDMMC1 clock enable **/
#define RCC_APB2ENR_SDMMC1EN		(1 << 11)
/** RCC_APB2ENR_ADC3EN ADC3 clock enable **/
#define RCC_APB2ENR_ADC3EN		(1 << 10)
/** RCC_APB2ENR_ADC2EN ADC2 clock enable **/
#define RCC_APB2ENR_ADC2EN		(1 << 9)
/** RCC_APB2ENR_ADC1EN ADC1 clock enable **/
#define RCC_APB2ENR_ADC1EN		(1 << 8)
/** RCC_APB2ENR_USART6EN USART6 clock enable **/
#define RCC_APB2ENR_USART6EN		(1 << 5)
/** RCC_APB2ENR_USART1EN USART1 clock enable **/
#define RCC_APB2ENR_USART1EN		(1 << 4)
/** RCC_APB2ENR_TIM8EN TIM8 clock enable **/
#define RCC_APB2ENR_TIM8EN		(1 << 1)
/** RCC_APB2ENR_TIM1EN TIM1 clock enable **/
#define RCC_APB2ENR_TIM1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1lpenr AHB1LPENR AHB1 peripheral clock enable in low power mode register
@{*/

/** RCC_AHB1LPENR_OTGHSULPILPEN USB OTG HS ULPI clock enable during Sleep mode **/
#define RCC_AHB1LPENR_OTGHSULPILPEN		(1 << 30)
/** RCC_AHB1LPENR_OTGHSLPEN USB OTG HS clock enable during Sleep mode **/
#define RCC_AHB1LPENR_OTGHSLPEN		(1 << 29)
/** RCC_AHB1LPENR_ETHMACPTPLPEN Ethernet PTP clock enable during Sleep mode **/
#define RCC_AHB1LPENR_ETHMACPTPLPEN		(1 << 28)
/** RCC_AHB1LPENR_ETHMACRXLPEN Ethernet reception clock enable during Sleep mode **/
#define RCC_AHB1LPENR_ETHMACRXLPEN		(1 << 27)
/** RCC_AHB1LPENR_ETHMACTXLPEN Ethernet transmission clock enable during Sleep mode **/
#define RCC_AHB1LPENR_ETHMACTXLPEN		(1 << 26)
/** RCC_AHB1LPENR_ETHMACLPEN Ethernet MAC clock enable during Sleep mode **/
#define RCC_AHB1LPENR_ETHMACLPEN		(1 << 25)
/** RCC_AHB1LPENR_DMA2DLPEN DMA2D clock enable during Sleep mode **/
#define RCC_AHB1LPENR_DMA2DLPEN		(1 << 23)
/** RCC_AHB1LPENR_DMA2LPEN DMA2 clock enable during Sleep mode **/
#define RCC_AHB1LPENR_DMA2LPEN		(1 << 22)
/** RCC_AHB1LPENR_DMA1LPEN DMA1 clock enable during Sleep mode **/
#define RCC_AHB1LPENR_DMA1LPEN		(1 << 21)
/** RCC_AHB1LPENR_SRAM3LPEN SRAM 3 interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_SRAM3LPEN		(1 << 19)
/** RCC_AHB1LPENR_BKPSRAMLPEN Backup SRAM interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_BKPSRAMLPEN		(1 << 18)
/** RCC_AHB1LPENR_SRAM2LPEN SRAM 2 interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_SRAM2LPEN		(1 << 17)
/** RCC_AHB1LPENR_SRAM1LPEN SRAM 1interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_SRAM1LPEN		(1 << 16)
/** RCC_AHB1LPENR_FLITFLPEN Flash interface clock enable during Sleep mode **/
#define RCC_AHB1LPENR_FLITFLPEN		(1 << 15)
/** RCC_AHB1LPENR_CRCLPEN CRC clock enable during Sleep mode **/
#define RCC_AHB1LPENR_CRCLPEN		(1 << 12)
/** RCC_AHB1LPENR_GPIOKLPEN IO port K clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOKLPEN		(1 << 10)
/** RCC_AHB1LPENR_GPIOJLPEN IO port J clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOJLPEN		(1 << 9)
/** RCC_AHB1LPENR_GPIOILPEN IO port I clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOILPEN		(1 << 8)
/** RCC_AHB1LPENR_GPIOHLPEN IO port H clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOHLPEN		(1 << 7)
/** RCC_AHB1LPENR_GPIOGLPEN IO port G clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOGLPEN		(1 << 6)
/** RCC_AHB1LPENR_GPIOFLPEN IO port F clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOFLPEN		(1 << 5)
/** RCC_AHB1LPENR_GPIOELPEN IO port E clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOELPEN		(1 << 4)
/** RCC_AHB1LPENR_GPIODLPEN IO port D clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIODLPEN		(1 << 3)
/** RCC_AHB1LPENR_GPIOCLPEN IO port C clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOCLPEN		(1 << 2)
/** RCC_AHB1LPENR_GPIOBLPEN IO port B clock enable during Sleep mode **/
#define RCC_AHB1LPENR_GPIOBLPEN		(1 << 1)
/** RCC_AHB1LPENR_GPIOALPEN IO port A clock enable during sleep mode **/
#define RCC_AHB1LPENR_GPIOALPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2lpenr AHB2LPENR AHB2 peripheral clock enable in low power mode register
@{*/

/** RCC_AHB2LPENR_OTGFSLPEN USB OTG FS clock enable during Sleep mode **/
#define RCC_AHB2LPENR_OTGFSLPEN		(1 << 7)
/** RCC_AHB2LPENR_RNGLPEN Random number generator clock enable during Sleep mode **/
#define RCC_AHB2LPENR_RNGLPEN		(1 << 6)
/** RCC_AHB2LPENR_HASHLPEN Hash modules clock enable during Sleep mode **/
#define RCC_AHB2LPENR_HASHLPEN		(1 << 5)
/** RCC_AHB2LPENR_CRYPLPEN Cryptography modules clock enable during Sleep mode **/
#define RCC_AHB2LPENR_CRYPLPEN		(1 << 4)
/** RCC_AHB2LPENR_DCMILPEN Camera interface enable during Sleep mode **/
#define RCC_AHB2LPENR_DCMILPEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3lpenr AHB3LPENR AHB3 peripheral clock enable in low power mode register
@{*/

