grevaillot/svd_tools/headers/STM32F7x5/rcc.h
/** @defgroup rcc_csr CSR clock control & status register
@{*/

/** RCC_CSR_LPWRRSTF Low-power reset flag **/
#define RCC_CSR_LPWRRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_WDGRSTF Independent watchdog reset flag **/
#define RCC_CSR_WDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PORRSTF POR/PDR reset flag **/
#define RCC_CSR_PORRSTF		(1 << 27)
/** RCC_CSR_PADRSTF PIN reset flag **/
#define RCC_CSR_PADRSTF		(1 << 26)
/** RCC_CSR_BORRSTF BOR reset flag **/
#define RCC_CSR_BORRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 24)
/** RCC_CSR_LSIRDY Internal low-speed oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION Internal low-speed oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_sscgr SSCGR spread spectrum clock generation register
@{*/

/** RCC_SSCGR_SSCGEN Spread spectrum modulation enable **/
#define RCC_SSCGR_SSCGEN		(1 << 31)
/** RCC_SSCGR_SPREADSEL Spread Select **/
#define RCC_SSCGR_SPREADSEL		(1 << 30)

#define RCC_SSCGR_INCSTEP_SHIFT		13
#define RCC_SSCGR_INCSTEP_MASK		0x7fff
/** @defgroup rcc_sscgr_incstep INCSTEP Incrementation step
@{*/
/**@}*/


#define RCC_SSCGR_MODPER_SHIFT		0
#define RCC_SSCGR_MODPER_MASK		0x1fff
/** @defgroup rcc_sscgr_modper MODPER Modulation period
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_plli2scfgr PLLI2SCFGR PLLI2S configuration register
@{*/


#define RCC_PLLI2SCFGR_PLLI2SR_SHIFT		28
#define RCC_PLLI2SCFGR_PLLI2SR_MASK		0x07
/** @defgroup rcc_plli2scfgr_plli2sr PLLI2SR PLLI2S division factor for I2S clocks
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SQ_SHIFT		24
#define RCC_PLLI2SCFGR_PLLI2SQ_MASK		0x0f
/** @defgroup rcc_plli2scfgr_plli2sq PLLI2SQ PLLI2S division factor for SAI1 clock
@{*/
/**@}*/


#define RCC_PLLI2SCFGR_PLLI2SN_SHIFT		6
#define RCC_PLLI2SCFGR_PLLI2SN_MASK		0x1ff
/** @defgroup rcc_plli2scfgr_plli2sn PLLI2SN PLLI2S multiplication factor for VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsaicfgr PLLSAICFGR PLL configuration register
@{*/


#define RCC_PLLSAICFGR_PLLSAIR_SHIFT		28
#define RCC_PLLSAICFGR_PLLSAIR_MASK		0x07
/** @defgroup rcc_pllsaicfgr_pllsair PLLSAIR PLLSAI division factor for LCD clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIQ_SHIFT		24
#define RCC_PLLSAICFGR_PLLSAIQ_MASK		0x0f
/** @defgroup rcc_pllsaicfgr_pllsaiq PLLSAIQ PLLSAI division factor for SAI clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIP_SHIFT		16
#define RCC_PLLSAICFGR_PLLSAIP_MASK		0x03
/** @defgroup rcc_pllsaicfgr_pllsaip PLLSAIP PLLSAI division factor for 48MHz clock
@{*/
/**@}*/


#define RCC_PLLSAICFGR_PLLSAIN_SHIFT		6
#define RCC_PLLSAICFGR_PLLSAIN_MASK		0x1ff
/** @defgroup rcc_pllsaicfgr_pllsain PLLSAIN PLLSAI division factor for VCO
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_dkcfgr1 DKCFGR1 dedicated clocks configuration register
@{*/

/** RCC_DKCFGR1_TIMPRE Timers clocks prescalers selection **/
#define RCC_DKCFGR1_TIMPRE		(1 << 24)

#define RCC_DKCFGR1_SAI2SEL_SHIFT		22
#define RCC_DKCFGR1_SAI2SEL_MASK		0x03
/** @defgroup rcc_dkcfgr1_sai2sel SAI2SEL SAI2 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR1_SAI1SEL_SHIFT		20
#define RCC_DKCFGR1_SAI1SEL_MASK		0x03
/** @defgroup rcc_dkcfgr1_sai1sel SAI1SEL SAI1 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR1_PLLSAIDIVR_SHIFT		16
#define RCC_DKCFGR1_PLLSAIDIVR_MASK		0x03
/** @defgroup rcc_dkcfgr1_pllsaidivr PLLSAIDIVR division factor for LCD_CLK
@{*/
/**@}*/


#define RCC_DKCFGR1_PLLSAIDIVQ_SHIFT		8
#define RCC_DKCFGR1_PLLSAIDIVQ_MASK		0x1f
/** @defgroup rcc_dkcfgr1_pllsaidivq PLLSAIDIVQ PLLSAI division factor for SAI1 clock
@{*/
/**@}*/


#define RCC_DKCFGR1_PLLI2SDIV_SHIFT		0
#define RCC_DKCFGR1_PLLI2SDIV_MASK		0x1f
/** @defgroup rcc_dkcfgr1_plli2sdiv PLLI2SDIV PLLI2S division factor for SAI1 clock
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_dkcfgr2 DKCFGR2 dedicated clocks configuration register
@{*/

/** RCC_DKCFGR2_SDMMCSEL SDMMC clock source selection **/
#define RCC_DKCFGR2_SDMMCSEL		(1 << 28)
/** RCC_DKCFGR2_CK48MSEL 48MHz clock source selection **/
#define RCC_DKCFGR2_CK48MSEL		(1 << 27)
/** RCC_DKCFGR2_CECSEL HDMI-CEC clock source selection **/
#define RCC_DKCFGR2_CECSEL		(1 << 26)

#define RCC_DKCFGR2_LPTIM1SEL_SHIFT		24
#define RCC_DKCFGR2_LPTIM1SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_lptim1sel LPTIM1SEL Low power timer 1 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_I2C4SEL_SHIFT		22
#define RCC_DKCFGR2_I2C4SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_i2c4sel I2C4SEL I2C4 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_I2C3SEL_SHIFT		20
#define RCC_DKCFGR2_I2C3SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_i2c3sel I2C3SEL I2C3 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_I2C2SEL_SHIFT		18
#define RCC_DKCFGR2_I2C2SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_i2c2sel I2C2SEL I2C2 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_I2C1SEL_SHIFT		16
#define RCC_DKCFGR2_I2C1SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_UART8SEL_SHIFT		14
#define RCC_DKCFGR2_UART8SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_uart8sel UART8SEL UART 8 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_UART7SEL_SHIFT		12
#define RCC_DKCFGR2_UART7SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_uart7sel UART7SEL UART 7 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_USART6SEL_SHIFT		10
#define RCC_DKCFGR2_USART6SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_usart6sel USART6SEL USART 6 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_UART5SEL_SHIFT		8
#define RCC_DKCFGR2_UART5SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_uart5sel UART5SEL UART 5 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_UART4SEL_SHIFT		6
#define RCC_DKCFGR2_UART4SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_uart4sel UART4SEL UART 4 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_USART3SEL_SHIFT		4
#define RCC_DKCFGR2_USART3SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_usart3sel USART3SEL USART 3 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_USART2SEL_SHIFT		2
#define RCC_DKCFGR2_USART2SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_usart2sel USART2SEL USART 2 clock source selection
@{*/
/**@}*/


#define RCC_DKCFGR2_USART1SEL_SHIFT		0
#define RCC_DKCFGR2_USART1SEL_MASK		0x03
/** @defgroup rcc_dkcfgr2_usart1sel USART1SEL USART 1 clock source selection
@{*/
/**@}*/


/**@}*/
